api/template_xml/solicitacao.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:sch="http://www.ans.gov.br/padroes/tiss/schemas"
    xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
    <soapenv:Header />
    <soapenv:Body>
        <sch:solicitacaoProcedimentoWS>
            <sch:cabecalho>
                <sch:identificacaoTransacao>
                    <sch:tipoTransacao>{tipo_transacao}</sch:tipoTransacao>
                    <sch:sequencialTransacao>{sequencial_transacao}</sch:sequencialTransacao>
                    <sch:dataRegistroTransacao>{data_registro_transacao}</sch:dataRegistroTransacao>
                    <sch:horaRegistroTransacao>{hora_registro_transacao}</sch:horaRegistroTransacao>
                </sch:identificacaoTransacao>
                <sch:origem>
                    <sch:identificacaoPrestador>
                        <sch:codigoPrestadorNaOperadora>{codigo_prestador_na_operadora}</sch:codigoPrestadorNaOperadora>
                    </sch:identificacaoPrestador>
                </sch:origem>
                <sch:destino>
                    <sch:registroANS>{registro_ANS}</sch:registroANS>
                    <sch:numeroGuiaOperadora>{numero_guia_operadora}</sch:numeroGuiaOperadora>
                </sch:destino>
                <sch:padrao>{padrao}</sch:padrao>
                <sch:loginSenhaPrestador>
                    <sch:loginPrestador>{login_prestador}</sch:loginPrestador>
                    <sch:senhaPrestador>{senha_prestador}</sch:senhaPrestador>
                </sch:loginSenhaPrestador>
            </sch:cabecalho>
            <sch:solicitacaoProcedimento>
                <sch:solicitacaoSP-SADT>
                    <sch:cabecalhoSolicitacao>
                        <sch:registroANS>{registro_ANS}</sch:registroANS>
                        <sch:numeroGuiaPrestador>{numero_guia_prestador}</sch:numeroGuiaPrestador>
                    </sch:cabecalhoSolicitacao>
                    <sch:tipoEtapaAutorizacao>{tipo_etapa_autorizacao}</sch:tipoEtapaAutorizacao>
                    <sch:dadosBeneficiario>
                        <sch:numeroCarteira>{numero_carteira}</sch:numeroCarteira>
                        <sch:atendimentoRN>{atendimento_rn}</sch:atendimentoRN>
                        <sch:nomeBeneficiario>{nome_beneficiario}</sch:nomeBeneficiario>
                        <sch:identificadorBeneficiario>{identificador_beneficiario}</sch:identificadorBeneficiario>
                    </sch:dadosBeneficiario>
                    <sch:dadosSolicitante>
                        <sch:contratadoSolicitante>
                            <sch:codigoPrestadorNaOperadora>{codigo_prestado_na_operadora}</sch:codigoPrestadorNaOperadora>
                            <sch:nomeContratado>{nome_contratado}</sch:nomeContratado>
                        </sch:contratadoSolicitante>
                        <sch:profissionalSolicitante>
                            <sch:nomeProfissional>{nome_profissional}</sch:nomeProfissional>
                            <sch:conselhoProfissional>{conselho_profissional}</sch:conselhoProfissional>
                            <sch:numeroConselhoProfissional>{numero_conselho_profissional}</sch:numeroConselhoProfissional>
                            <sch:UF>{uf}</sch:UF>
                            <sch:CBOS>{cbos}</sch:CBOS>
                        </sch:profissionalSolicitante>
                    </sch:dadosSolicitante>
                    <sch:caraterAtendimento>{carater_atendimento}</sch:caraterAtendimento>
                    <sch:dataSolicitacao>{data_solicitacao}</sch:dataSolicitacao>
                    <sch:indicacaoClinica>{indicacao_clinica}</sch:indicacaoClinica>
                    <sch:tipoAtendimento>{tipo_atendimento}</sch:tipoAtendimento>
                    <sch:indicacaoAcidente>{indicacao_acidente}</sch:indicacaoAcidente>
                    <sch:procedimentosSolicitados>
                        <sch:procedimento>
                            <sch:codigoProcedimento>{codigo_procedimento}</sch:codigoProcedimento>
                            <sch:descricaoProcedimento>{descricao_procedimento}</sch:descricaoProcedimento>
                        </sch:procedimento>
                        <sch:quantidadeSolicitada>{quantidade_solicitada}</sch:quantidadeSolicitada>
                    </sch:procedimentosSolicitados>
                    <sch:dadosExecutante>
                        <sch:codigoOperadora>{codigo_operadora}</sch:codigoOperadora>
                        <sch:nomeContratado>{nome_contratado}</sch:nomeContratado>
                    </sch:dadosExecutante>
                    <sch:observacao>{observacao}</sch:observacao>
                </sch:solicitacaoSP-SADT>
            </sch:solicitacaoProcedimento>
            <sch:hash>{hash}</sch:hash>
        </sch:solicitacaoProcedimentoWS>
    </soapenv:Body>
</soapenv:Envelope>