api/template_xml/resposta_autorizado.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas"
    xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
    <soapenv:Header />
    <soapenv:Body>
        <ans:autorizacaoProcedimentoWS>
            <ans:cabecalho>
                <ans:identificacaoTransacao>
                    <ans:tipoTransacao>RESPOSTA_SOLICITACAO</ans:tipoTransacao>
                    <ans:sequencialTransacao>1111</ans:sequencialTransacao>
                    <ans:dataRegistroTransacao>2016-12-01</ans:dataRegistroTransacao>
                    <ans:horaRegistroTransacao>12:00:00</ans:horaRegistroTransacao>
                </ans:identificacaoTransacao>
                <ans:origem>
                    <ans:registroANS>111111</ans:registroANS>
                </ans:origem>
                <ans:destino>
                    <ans:identificacaoPrestador>
                        <ans:CNPJ>00111222000100</ans:CNPJ>
                    </ans:identificacaoPrestador>
                </ans:destino>
                <ans:Padrao>3.03.01</ans:Padrao>
                <ans:loginSenhaPrestador>
                    <ans:loginPrestador>TESTE001</ans:loginPrestador>
                    <ans:senhaPrestador>9c4c9c4c9c4c9c4c9c4c9c4c9c4c9c4c</ans:senhaPrestador>
                </ans:loginSenhaPrestador>
            </ans:cabecalho>
            <ans:autorizacaoProcedimento>
                <ans:autorizacaoServico>
                    <ans:dadosAutorizacao>
                        <ans:numeroGuiaPrestador>1111</ans:numeroGuiaPrestador>
                        <ans:numeroGuiaOperadora>2222</ans:numeroGuiaOperadora>
                        <ans:dataAutorizacao>2016-12-01</ans:dataAutorizacao>
                        <ans:senha>000000001</ans:senha>
                    </ans:dadosAutorizacao>
                    <ans:dadosBeneficiario>
                        <ans:numeroCarteira>1111111111111</ans:numeroCarteira>
                        <ans:atendimentoRN>N</ans:atendimentoRN>
                        <ans:nomeBeneficiario>BENEFICIARIO</ans:nomeBeneficiario>
                    </ans:dadosBeneficiario>
                    <ans:prestadorAutorizado>
                        <ans:dadosContratado>
                            <ans:codigoPrestadorNaOperadora>1111</ans:codigoPrestadorNaOperadora>
                            <ans:nomeContratado>CONTRATADO</ans:nomeContratado>
                        </ans:dadosContratado>
                        <ans:cnesContratado>9999999</ans:cnesContratado>
                    </ans:prestadorAutorizado>
                    <ans:statusSolicitacao>1</ans:statusSolicitacao>
                    <ans:servicosAutorizados>
                        <ans:servicoAutorizado>
                            <ans:procedimento>
                                <ans:codigoTabela>22</ans:codigoTabela>
                                <ans:codigoProcedimento>40101010</ans:codigoProcedimento>
                                <ans:descricaoProcedimento>ECG CONVENCIONAL DE AT</ans:descricaoProcedimento>
                            </ans:procedimento>
                            <ans:quantidadeSolicitada>1</ans:quantidadeSolicitada>
                            <ans:quantidadeAutorizada>1</ans:quantidadeAutorizada>
                        </ans:servicoAutorizado>
                    </ans:servicosAutorizados>
                </ans:autorizacaoServico>
            </ans:autorizacaoProcedimento>
            <ans:hash>A551AF234DF921F8AA6CEAC4E2FE579D</ans:hash>
        </ans:autorizacaoProcedimentoWS>
    </soapenv:Body>
</soapenv:Envelope>